[
  {
    "image": "https://i.ibb.co/cKsQ4ByJ/web-development.jpg",
    "title": "Web Development",
    "companyName": "Michael Chen",
    "id": 1,
    "description": "Learn the fundamentals of modern software development from an industry.",
    "price": 150,
    "reviews": "69K",
    "ratingAvg": 4.5,
    "downloads": "5.8K",
    "appDetails": "This comprehensive course covers the fundamentals of modern development, from version control with Git to core programming principles. Taught by Michael Chen, you'll build a solid foundation for any software engineering career."
  },
  {
    "image": "https://i.ibb.co/y1X5Ty1/Active-Storage-164-20240502-4130-wdb3r9-de4aae294c.png",
    "title": "Android Developer",
    "companyName": "Alex Johnson",
    "id": 2,
    "description": "Build and deploy your first native Android applications from scratch.",
    "price": 130,
    "reviews": "4.5K",
    "ratingAvg": 4.6,
    "downloads": "8.2K",
    "appDetails": "Join Alex Johnson and learn to build and deploy native Android applications. This course covers Kotlin, Jetpack Compose, and how to manage app lifecycles, network requests, and database storage for a complete project."
  },
  {
    "image": "https://i.ibb.co/FLnm0S2M/img-javascript-480.jpg",
    "title": "Java Script Course",
    "companyName": "David Lee",
    "id": 3,
    "description": "Master the most popular programming language on the web.",
    "price": 140,
    "reviews": "7.8K",
    "ratingAvg": 4.7,
    "downloads": "12.5K",
    "appDetails": "Master JavaScript with David Lee, from the basics to advanced concepts. This course covers ES6+, closures, async programming, and DOM manipulation to build interactive and dynamic websites."
  },
  {
    "image": "https://i.ibb.co/1Ysbm0zt/images.png",
    "title": "Android Developer",
    "companyName": "Sarah Kim",
    "id": 4,
    "description": "Take your Android development skills to the next level with advanced UI.",
    "price": 120,
    "reviews": "1.2K",
    "ratingAvg": 4.4,
    "downloads": "4.3K",
    "appDetails": "An intermediate course by Sarah Kim focusing on advanced Android UI and performance. You'll learn about complex custom views, animations, and profiling tools to build professional, high-performance apps."
  },
  {
    "image": "https://i.ibb.co/XZxJ5ps7/tendencias-de-marketing-para-2022.webp",
    "title": "Java Script Course",
    "companyName": "Maria Garcia",
    "id": 5,
    "description": "Build real-world projects using modern JavaScript frameworks.",
    "price": 120,
    "reviews": "9.2K",
    "ratingAvg": 4.8,
    "downloads": "21K",
    "appDetails": "A project-based approach to learning modern JavaScript. Maria Garcia guides you through building five different applications using frameworks like React, Vue, and Svelte, solidifying your skills."
  },
  {
    "image": "https://i.ibb.co/NQT2YnG/image.jpg",
    "title": "Basic Marketing",
    "companyName": "Robert Brown",
    "id": 6,
    "description": "Understand the core principles of marketing in the digital age.",
    "price": 100,
    "reviews": "3.4K",
    "ratingAvg": 4.3,
    "downloads": "11K",
    "appDetails": "Learn the fundamentals of modern marketing with Robert Brown. This course covers market research, customer segmentation, branding, and the 4 Ps of marketing to help you build a successful strategy."
  },
  {
    "image": "https://i.ibb.co/yFLKYkcr/osd-android-1.png",
    "title": "React - The Complete Guide",
    "companyName": "Emily White",
    "id": 7,
    "description": "Build powerful, fast, and scalable web applications with React.",
    "price": 190,
    "reviews": "18K",
    "ratingAvg": 4.9,
    "downloads": "45K",
    "appDetails": "Dive deep into React with Emily White. This complete guide covers everything from components and props to state management with Redux, React Router, and advanced hooks. You'll build a major portfolio project from start to finish."
  },
  {
    "image": "https://i.ibb.co/XxtvxS3p/iphone-application-development-technource.png",
    "title": "Python for Data Science",
    "companyName": "Daniel Smith",
    "id": 8,
    "description": "Harness the power of Python for data analysis and machine learning.",
    "price": 160,
    "reviews": "11K",
    "ratingAvg": 4.7,
    "downloads": "32K",
    "appDetails": "Learn Python programming for data analysis, visualization, and machine learning with Daniel Smith. This course covers Pandas, NumPy, Matplotlib, and Scikit-Learn to help you analyze data and build predictive models."
  },
  {
    "image": "https://i.ibb.co/WN8KtzFj/i-OS-app-developme.png",
    "title": "UI/UX Design Fundamentals",
    "companyName": "Olivia Jones",
    "id": 9,
    "description": "Learn to design intuitive and beautiful user-centric products.",
    "price": 110,
    "reviews": "5.5K",
    "ratingAvg": 4.6,
    "downloads": "17K",
    "appDetails": "A hands-on course by Olivia Jones to learn user research, wireframing, and prototyping. You'll master tools like Figma and understand the principles of user-centered design to create engaging digital experiences."
  },
  {
    "image": "https://i.ibb.co/Xkv5Kg0M/is-web-development-good-career.jpg",
    "title": "Digital Marketing Strategy",
    "companyName": "Robert Brown",
    "id": 10,
    "description": "Drive growth with a comprehensive digital marketing plan.",
    "price": 125,
    "reviews": "2.9K",
    "ratingAvg": 4.4,
    "downloads": "9.5K",
    "appDetails": "Explore advanced SEO, SEM, social media, and content marketing strategies with Robert Brown. This course focuses on creating an integrated digital plan, analyzing metrics, and optimizing campaigns for maximum ROI."
  },
  {
    "image": "https://example.com/images/course-swift.jpg",
    "title": "iOS Development with Swift",
    "companyName": "Sarah Kim",
    "id": 11,
    "description": "Build beautiful, high-performance apps for iPhone and iPad.",
    "price": 170,
    "reviews": "1.8K",
    "ratingAvg": 4.5,
    "downloads": "6.1K",
    "appDetails": "Build native apps for the Apple ecosystem with Sarah Kim. This course covers the Swift language, SwiftUI, and Xcode, guiding you through building and publishing your first app on the App Store."
  },
  {
    "image": "https://example.com/images/course-ml.jpg",
    "title": "Machine Learning A-Z",
    "companyName": "Daniel Smith",
    "id": 12,
    "description": "Master machine learning models from regression to deep learning.",
    "price": 200,
    "reviews": "14K",
    "ratingAvg": 4.8,
    "downloads": "52K",
    "appDetails": "A comprehensive A-Z guide to machine learning with Daniel Smith. You'll master models like linear regression, k-NN, decision trees, and dive into deep learning with neural networks, all with practical Python examples."
  },
  {
    "image": "https://example.com/images/course-aws.jpg",
    "title": "Cloud Computing (AWS)",
    "companyName": "James Williams",
    "id": 13,
    "description": "Become a cloud expert and prepare for AWS certification.",
    "price": 180,
    "reviews": "8.1K",
    "ratingAvg": 4.7,
    "downloads": "28K",
    "appDetails": "Master the fundamentals of cloud computing with James Williams, focusing on Amazon Web Services. This course covers core services like EC2, S3, and RDS, and prepares you for the AWS Certified Cloud Practitioner exam."
  },
  {
    "image": "https://example.com/images/course-node.jpg",
    "title": "Node.js Bootcamp",
    "companyName": "Maria Garcia",
    "id": 14,
    "description": "Build fast, scalable, and secure server-side applications.",
    "price": 150,
    "reviews": "6.2K",
    "ratingAvg": 4.6,
    "downloads": "19K",
    "appDetails": "Learn to build fast and scalable server-side applications with Node.js and Express. Maria Garcia covers RESTful APIs, asynchronous programming, and connecting to databases like MongoDB."
  },
  {
    "image": "https://example.com/images/course-sql.jpg",
    "title": "SQL for Beginners",
    "companyName": "Alex Johnson",
    "id": 15,
    "description": "Unlock the power of data by mastering SQL database queries.",
    "price": 90,
    "reviews": "7K",
    "ratingAvg": 4.5,
    "downloads": "25K",
    "appDetails": "Master the art of querying databases with Alex Johnson. This course is for absolute beginners and covers everything from simple SELECT statements to complex JOINs, subqueries, and data aggregation."
  },
  {
    "image": "https://example.com/images/course-business.jpg",
    "title": "Business Analytics",
    "companyName": "Sophia Brown",
    "id": 16,
    "description": "Learn to use data to make smarter, more effective business decisions.",
    "price": 130,
    "reviews": "2.3K",
    "ratingAvg": 4.2,
    "downloads": "7.6K",
    "appDetails": "Learn to use data to make smarter business decisions with Sophia Brown. This course provides a practical overview of business analytics, covering data visualization in Tableau, SQL queries, and basic statistical analysis in Excel."
  },
  {
    "image": "https://example.com/images/course-fullstack.jpg",
    "title": "Full-Stack Web Developer",
    "companyName": "Michael Chen",
    "id": 17,
    "description": "Become a complete full-stack developer with the MERN stack.",
    "price": 220,
    "reviews": "15K",
    "ratingAvg": 4.8,
    "downloads": "39K",
    "appDetails": "The complete guide to becoming a full-stack developer, taught by Michael Chen. This course covers the MERN stack in-depth: MongoDB, Express, React, and Node.js. You'll build a complex, production-ready web application."
  },
  {
    "image": "https://example.com/images/course-design.jpg",
    "title": "Graphic Design Masterclass",
    "companyName": "Olivia Jones",
    "id": 18,
    "description": "Learn the principles and tools of professional graphic design.",
    "price": 105,
    "reviews": "4.8K",
    "ratingAvg": 4.7,
    "downloads": "14K",
    "appDetails": "Learn typography, color theory, and layout principles with Olivia Jones. This masterclass guides you through the design process and mastering tools like Adobe Photoshop, Illustrator, and InDesign."
  },
  {
    "image": "https://example.com/images/course-security.jpg",
    "title": "Cybersecurity Essentials",
    "companyName": "David Lee",
    "id": 19,
    "description": "Understand the fundamentals of network security and ethical hacking.",
    "price": 175,
    "reviews": "3.1K",
    "ratingAvg": 4.6,
    "downloads": "10.5K",
    "appDetails": "Protect yourself and organizations from cyber threats. David Lee covers the fundamentals of cybersecurity, including network security, cryptography, malware analysis, and the basics of ethical hacking."
  },
  {
    "image": "https://example.com/images/course-pm.jpg",
    "title": "Project Management Pro",
    "companyName": "Sophia Brown",
    "id": 20,
    "description": "Master Agile, Scrum, and PMP methodologies to lead projects.",
    "price": 140,
    "reviews": "4K",
    "ratingAvg": 4.5,
    "downloads": "13K",
    "appDetails": "Learn to manage projects successfully with Sophia Brown. This course covers both traditional and modern project management, focusing on Agile, Scrum, and the core knowledge areas of the PMP certification."
  }
]