[
  {
    "image": "https://i.ibb.co/DH1LvWTj/game1.jpg",
    "title": "God of War Mobile",
    "companyName": "Santa Monica Studio",
    "id": 1,
    "description": "Kratos and Atreus journey to each of the Nine Realms in search of answers.",
    "size": 840,
    "reviews": "1.8M",
    "ratingAvg": 4.9,
    "downloads": "20M",
    "appDetails": "Embark on an epic journey across the Nine Realms as Kratos and his son Atreus seek answers to the mysteries of Ragnarok. Face off against Norse gods and monsters in breathtaking environments filled with secrets, puzzles, and powerful battles. Every choice you make shapes the bond between father and son in this cinematic masterpiece adapted for mobile."
  },
  {
    "image": "https://i.ibb.co/d07SjCDY/game2.png",
    "title": "The Witcher II",
    "companyName": "Guerrilla Games",
    "id": 2,
    "description": "Aloy braves a majestic but dangerous frontier, facing new machine threats.",
    "size": 920,
    "reviews": "1.1M",
    "ratingAvg": 4.8,
    "downloads": "15M",
    "appDetails": "Step into a lush, post-apocalyptic world where colossal machines rule the wilds. As Aloy, a skilled hunter and archer, you must uncover the truth about your mysterious origins and confront the mechanical beasts that threaten humanity’s survival. Explore dynamic environments, craft advanced weapons, and experience an unforgettable open-world adventure filled with danger and discovery."
  },
  {
    "image": "https://i.ibb.co/kgBM3M9j/game3.jpg",
    "title": "Call of Duty Mobile",
    "companyName": "Bethesda Game Studios",
    "id": 3,
    "description": "An open‐world RPG set amongst the stars, where you create.",
    "size": 125,
    "reviews": "850K",
    "ratingAvg": 4.7,
    "downloads": "12M",
    "appDetails": "Call of Duty Mobile brings the legendary FPS experience to your fingertips. Engage in thrilling multiplayer modes, iconic maps, and cinematic story missions. Build your custom loadouts, team up with friends, and compete globally in fast-paced, tactical combat designed for both casual players and competitive warriors."
  },
  {
    "image": "https://i.ibb.co/Qv8013Lx/game4.jpg",
    "title": "Fireemblem Three House",
    "companyName": "Playground Games",
    "id": 4,
    "description": "Explore the vibrant and ever-evolving open-world landscapes of Mexico.",
    "size": 110,
    "reviews": "950K",
    "ratingAvg": 4.8,
    "downloads": "30M",
    "appDetails": "Step into a beautifully realized open-world set across vibrant regions of Mexico. Command your armies, forge relationships, and lead your students in strategic battles that determine the fate of kingdoms. Experience heartfelt storytelling, branching narratives, and deep tactical combat that define the Fire Emblem legacy."
  },
  {
    "image": "https://i.ibb.co/7q0xPwj/elden-ring-patch-incoming-performance-issues-save-data.jpg",
    "title": "Street Fighter 6",
    "companyName": "Capcom",
    "id": 5,
    "description": "The next evolution of the fighting genre, featuring classic.",
    "size": 60,
    "reviews": "400K",
    "ratingAvg": 4.1,
    "downloads": "5M",
    "appDetails": "Street Fighter 6 redefines the fighting game experience with stunning visuals, iconic characters, and a brand-new battle system. Master classic fighters like Ryu and Chun-Li or explore new challengers with unique styles. Engage in online tournaments, hone your combos, and feel the adrenaline of each match in the most dynamic Street Fighter yet."
  },
  {
    "image": "https://i.ibb.co/nM9VwZMS/RAD-Ali-T-TMNT-Banner-740-800-Logo-2-12549.webp",
    "title": "Mortal Kombat 1",
    "companyName": "NetherRealm Studios",
    "id": 6,
    "description": "A reborn Mortal Kombat Universe Fire God Liu Kang.",
    "size": 100,
    "reviews": "380K",
    "ratingAvg": 4.2,
    "downloads": "4.5M",
    "appDetails": "Enter a reborn Mortal Kombat universe shaped by Fire God Liu Kang. Experience a brutal yet beautifully choreographed combat system featuring reimagined fighters and new finishing moves. The story mode unveils shocking twists as you forge alliances, unlock characters, and fight to define the destiny of the realms."
  },
  {
    "image": "https://i.ibb.co/ynJqS3RY/im-still-waiting-for-the-remastered-version-v0-8kyawsqqsece1.webp",
    "title": "Final Fantasy XVI",
    "companyName": "Square Enix",
    "id": 7,
    "description": "A dark fantasy action-RPG following quest for revenge.",
    "size": 900,
    "reviews": "510K",
    "ratingAvg": 4.3,
    "downloads": "6M",
    "appDetails": "Dive into the dark and dramatic world of Valisthea, where nations wield the power of magical Eikons. Follow Clive Rosfield, a warrior consumed by vengeance, as he battles monstrous foes and uncovers the truth behind a shattered destiny. Experience cinematic storytelling, real-time combat, and stunning visuals in one of the boldest Final Fantasy adventures ever created."
  },
  {
    "image": "https://i.ibb.co/Xkssxv2s/WM-VG-Top-10-Most-Video-Popular-Games-of-the-Century-So-Far-I4-N9-H8-MPF-480.webp",
    "title": "Resident Evil 4 (Remake)",
    "companyName": "Capcom",
    "id": 8,
    "description": "A complete reimagining of the 2005 classic.",
    "size": 680,
    "reviews": "720K",
    "ratingAvg": 3.9,
    "downloads": "8M",
    "appDetails": "Re-experience the horror and intensity of the 2005 classic, reimagined with modern visuals and gameplay mechanics. Step into the shoes of Leon S. Kennedy on a mission to rescue the President’s daughter from a mysterious cult in a secluded village. Face grotesque enemies, solve intricate puzzles, and survive a relentless nightmare that has defined the survival horror genre."
  },
  {
    "image": "https://i.ibb.co/nNkwZgcs/ff-tactics.jpg",
    "title": "Dead Space (Remake)",
    "companyName": "Motive Studio",
    "id": 9,
    "description": "The sci-fi survival-horror the ground up.",
    "size": 55,
    "reviews": "430K",
    "ratingAvg": 3.8,
    "downloads": "5M",
    "appDetails": "Dead Space (Remake) brings back the terror of deep space with enhanced visuals, audio, and atmosphere. As Isaac Clarke, navigate the abandoned USG Ishimura, where monstrous Necromorphs lurk in the shadows. Every dark corner, every creaking sound heightens the fear in this masterfully crafted sci-fi horror experience."
  },
  {
    "image": "https://i.ibb.co/nM6x2S4t/pexels-pixabay-163064-1.jpg",
    "title": "Marvel’s Spider-Man 2",
    "companyName": "Insomniac Games",
    "id": 10,
    "description": "Peter Parker and Miles Morales team up to face.",
    "size": 98,
    "reviews": "1.3M",
    "ratingAvg": 3.8,
    "downloads": "18M",
    "appDetails": "Swing through the vibrant streets of New York as both Peter Parker and Miles Morales in an electrifying story of heroism, brotherhood, and sacrifice. Master new symbiote abilities, face powerful villains like Venom and Kraven, and experience heart-pounding action sequences that push superhero storytelling to new heights."
  },
  {
    "image": "https://i.ibb.co/0VvyJGkw/Top-10-Video-Games-with-Most-Popular-Merchandise.webp",
    "title": "The Sims 4",
    "companyName": "Maxis",
    "id": 11,
    "description": "Create and control and explore vibrant worlds.",
    "size": 50,
    "reviews": "2.2M",
    "ratingAvg": 4.3,
    "downloads": "80M",
    "appDetails": "Create unique Sims, design their dream homes, and explore a variety of vibrant worlds. Control every aspect of your Sims’ lives — from careers to relationships — and tell endless stories in this ultimate life simulation experience. Customize, build, and live without limits in The Sims 4."
  },
  {
    "image": "https://i.ibb.co/JwD1CGJp/pexels-pixabay-262333.jpg",
    "title": "Fall Guys",
    "companyName": "Mediatonic",
    "id": 12,
    "description": "A free-to-play, massively multiplayer absurd obstacle courses.",
    "size": 180,
    "reviews": "1.9M",
    "ratingAvg": 4.2,
    "downloads": "60M",
    "appDetails": "Join millions of players in chaotic obstacle course battles where only one can claim the crown! Compete through colorful, hilarious rounds filled with physics-based challenges. Customize your jellybean avatar and laugh your way to victory in the ultimate multiplayer party royale."
  },
  {
    "image": "https://i.ibb.co/gMCcf359/pexels-element5-1293261.jpg",
    "title": "Deep Rock Galactic",
    "companyName": "Ghost Ship Games",
    "id": 13,
    "description": "A 1-4 player co-op FPS featuring destructible environments.",
    "size": 30,
    "reviews": "350K",
    "ratingAvg": 4.1,
    "downloads": "10M",
    "appDetails": "Join a team of space Dwarves as you mine precious resources, battle alien creatures, and survive dangerous caves. With fully destructible environments, procedural generation, and teamwork-driven missions, Deep Rock Galactic delivers chaotic fun and endless replayability for co-op enthusiasts."
  },
  {
    "image": "https://i.ibb.co/kgBM3M9j/game3.jpg",
    "title": "Valheim",
    "companyName": "Iron Gate Studio",
    "id": 14,
    "description": "A brutal exploration and survival inspired by Norse mythology.",
    "size": 120,
    "reviews": "600K",
    "ratingAvg": 4.1,
    "downloads": "12M",
    "appDetails": "Explore, build, and survive in the afterlife of Viking warriors. Craft weapons, sail across vast seas, and conquer mighty beasts as you strive to bring order to Valheim. Inspired by Norse mythology, this brutal survival game challenges your courage and creativity in equal measure."
  },
  {
    "image": "https://i.ibb.co/Qv8013Lx/game4.jpg",
    "title": "Phasmophobia",
    "companyName": "Kinetic Games",
    "id": 15,
    "description": "A 4-player online co-op where you hunt ghosts.",
    "size": 170,
    "reviews": "750K",
    "ratingAvg": 4.1,
    "downloads": "15M",
    "appDetails": "Gather your friends and step into haunted locations where every sound and shadow could be a ghostly presence. Use paranormal investigation tools, collect evidence, and survive terrifying encounters in this spine-chilling co-op horror experience that blurs the line between the living and the dead."
  },
  {
    "image": "https://i.ibb.co/d07SjCDY/game2.png",
    "title": "Escape from Tarkov",
    "companyName": "Battlestate Games",
    "id": 16,
    "description": "A hardcore and realistic RPG/Simulator with MMO features.",
    "size": 35,
    "reviews": "480K",
    "ratingAvg": 4.1,
    "downloads": "9M",
    "appDetails": "Enter the war-torn city of Tarkov — a realistic, hardcore FPS where every decision counts. Scavenge for weapons, gear, and supplies while facing unpredictable enemies and players. With deep survival mechanics, realistic gunplay, and intense tension, Escape from Tarkov is the ultimate test of skill and strategy."
  },
  {
    "image": "https://i.ibb.co/gFHzd6K1/pexels-pixabay-278918.jpg",
    "title": "Monster Hunter Rise",
    "companyName": "Capcom",
    "id": 17,
    "description": "Hunt gigantic monsters using new tools like the Wirebug.",
    "size": 36,
    "reviews": "390K",
    "ratingAvg": 4.1,
    "downloads": "14M",
    "appDetails": "Embark on thrilling hunts across diverse landscapes inspired by Japanese folklore. Use the new Wirebug mechanic to scale walls, perform aerial attacks, and chase colossal monsters. Customize your weapons, upgrade your armor, and team up with friends to conquer creatures beyond imagination."
  },
  {
    "image": "https://i.ibb.co/Qv8013Lx/game4.jpg",
    "title": "It Takes Two",
    "companyName": "Hazelight Studios",
    "id": 18,
    "description": "A genre-bending platform adventure built purely for co-op.",
    "size": 50,
    "reviews": "410K",
    "ratingAvg": 4.1,
    "downloads": "16M",
    "appDetails": "Embark on a heartwarming and hilarious co-op adventure as Cody and May, a couple turned into dolls by magic. Work together to overcome imaginative challenges that test teamwork and creativity. It Takes Two delivers a one-of-a-kind journey full of emotional storytelling and breathtaking design."
  },
  {
    "image": "https://i.ibb.co/kgBM3M9j/game3.jpg",
    "title": "Destiny 2",
    "companyName": "Bungie",
    "id": 19,
    "description": "An action MMO with one evolving friends can join anytime.",
    "size": 105,
    "reviews": "1.4M",
    "ratingAvg": 4.1,
    "downloads": "70M",
    "appDetails": "Join millions of Guardians in a vast online universe filled with legendary weapons, epic raids, and dynamic world events. Choose your class, customize your abilities, and defend humanity from alien threats in ever-evolving adventures that combine action, strategy, and community-driven gameplay."
  },
  {
    "image": "https://i.ibb.co/9kZGR9X0/pexels-pixabay-267355.jpg",
    "title": "Diablo II: Resurrected",
    "companyName": "Blizzard Entertainment",
    "id": 20,
    "description": "The definitive remastering complete 3D graphics.",
    "size": 30,
    "reviews": "280K",
    "ratingAvg": 4.2,
    "downloads": "7M",
    "appDetails": "Experience the legendary action RPG reborn with remastered 3D visuals, dynamic lighting, and improved audio. Battle through hellish hordes across five epic acts, collect powerful loot, and relive the dark fantasy story that defined a generation of gamers. Diablo II: Resurrected blends nostalgia with modern gameplay perfection."
  }
]
